#include <stdio.h>
#include <locale.h>
int main()
{
	setlocale(LC_ALL, "RUS");
	printf("Остаток от деления %d на %d равен %d\n ", 7, 5, 7 % 5);
	printf("Результат умножения %d на %d равен %d\n ", 2000, 4, 2000 * 4);
	printf("%g разделить %e равно %f\n ", 5., 2., 5. / 2);
	printf("%d разделить %d равно %d\n ", 5., 2., 5. / 2);
	printf("%f разделить %f равно %f\n ", 5., 2., 5. / 2);
	printf("%g разделить %g равно %g\n ", 5., 2., 5. / 2);
	printf("%e разделить %e равно %e\n ", 5., 2., 5. / 2);
	int N = 22, K = 38;
	printf("Сейчас %d часов %d минут 00 секунд\n", N,K);
	printf("Идет %d минута суток\n", 1358);
	printf("До полуночи осталось %d часов и %d минут\n", 1,22);
	printf("С 8:00 прошло %d секунд\n", 56680);
	printf("Текущий час = %f и текущая минута = %f часа\n", N / 24., K / 60.);
	printf("Дано:\n");
	printf("%10d\n", 4);
	printf("%10d\n", 333);
	printf("Ответ:\n");
	printf("+00%.1f\n", 4. / 333.);
	printf("%s", "Это текст");
	getchar();
}